import { LoginPage } from "./LoginPage/LoginPage";
import { ProductsPage } from "./ProductsPage/ProductsPage";

export { LoginPage, ProductsPage };

/*
Цей патерн називається Barrel Export (або Index Export Pattern).
файл index.ts служить як центральна точка експорту для модулів з певної директорії або пакету.

Основні переваги цього патерну:
Спрощення імпортів 
Інкапсуляція структури - зовнішній код не потребує знати внутрішню організацію директорії
Легше рефакторинг - зміни в структурі файлів потребують оновлення лише index.ts
Чистіший API - контролюєте, що саме експортується з модуля
Цей патерн особливо корисний для організації великих проектів з багатьма модулями.
*/
